---
kind: method
id: M:Autodesk.Revit.DB.ReferenceArray.Clear
source: html/47a9c3cb-9d10-665c-122c-bc7f1f5c66f4.htm
---
# Autodesk.Revit.DB.ReferenceArray.Clear Method

Removes every reference from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```